INSERT INTO users (name, phone, password, registered)
VALUES ('Admin','9001001001','{noop}admin', '2021-05-01 00:00:00'),
       ('Voter','9002002002','{noop}blank', '2021-05-01 00:00:00');

INSERT INTO user_roles (role, user_id)
VALUES ('ADMIN', 1),
       ('VOTER', 1),
       ('VOTER', 2);

INSERT INTO restaurants (name, user_id)
VALUES ('Art-Caviar', 1),
       ('Home Cafe Петергоф', 1),
       ('Mr. Bo', 1);

INSERT INTO dishs (title, price, date_menu, restaurant_id, user_id)
VALUES ('Панна-котта с клубникой', 131, '2021-05-01 06:10:00', 1, 1),
       ('Жареные креветки с чесноком и чили', 221, '2021-05-01 05:18:00', 1, 1),
       ('Картофельные драники с вешенками', 199, '2021-05-01 04:20:00', 1, 1),
       ('Перец с начинкой из Хайбиф фарша с соусом Вьерж с базиликом', 218, '2021-05-01 03:44:00', 2, 1),
       ('Крем-суп из тыквы с миндалем', 231, '2021-05-01 07:02:01', 2, 1),
       ('Карпаччо из кабачков с сыром тофу', 134, '2021-05-01 08:11:11', 3, 1),
       ('Поке Авокадо', 242, '2021-05-01 08:11:12', 3, 1);

INSERT INTO votes (date_vote, restaurant_id, user_id)
VALUES ('2021-05-01 07:21:00', 3, 2),
       ('2021-05-01 09:10:00', 3, 2),
       ('2021-05-01 10:12:00', 1, 2),
       ('2021-05-01 10:13:00', 2, 2),
       ('2021-05-01 12:13:01', 1, 2),
       ('2021-05-01 06:23:00', 2, 1),
       ('2021-05-01 10:14:00', 2, 1),
       ('2021-05-01 11:00:01', 1, 1);
