INSERT INTO users (name)
VALUES ('Admin_1'),
       ('Voter_2'),
       ('Voter_3'),
       ('Voter_4'),
       ('Voter_5');

INSERT INTO user_roles (role, user_id)
VALUES ('VOTER', 2),
       ('ADMIN', 1),
       ('VOTER', 1);

INSERT INTO restaurants (title)
VALUES ('Art-Caviar'),
       ('Home Cafe Петергоф'),
       ('Mr. Bo');

INSERT INTO menu_items (dish, price, menu_date, restaurant_id, user_id)
VALUES ('Панна-котта с клубникой', 131, '2021-05-01 06:10:00', 1, 1),
       ('Жареные креветки с чесноком и чили', 221, '2021-05-01 05:18:00', 1, 1),
       ('Картофельные драники с вешенками', 199, '2021-05-01 04:20:00', 1, 1),
       ('Перец с начинкой из Хайбиф фарша с соусом Вьерж с базиликом', 218, '2021-05-01 03:44:00', 2, 1),
       ('Крем-суп из тыквы с миндалем', 231, '2021-05-01 07:02:01', 2, 1),
       ('Карпаччо из кабачков с сыром тофу', 134, '2021-05-01 08:11:11', 3, 1),
       ('Поке Авокадо', 242, '2021-05-01 08:11:12', 3, 1);

INSERT INTO votes (vote_date,restaurant_id,user_id)
VALUES ('2021-05-01 10:12:00', 1, 2),
       ('2021-05-01 10:13:00', 1, 3),
       ('2021-05-01 10:14:00', 2, 4),
       ('2021-05-01 09:10:00', 3, 5),
       ('2021-05-01 07:21:00', 3, 2),
       ('2021-05-01 06:23:00', 2, 3),
       ('2021-05-01 11:00:01', 1, 4),
       ('2021-05-01 12:13:01', 1, 5);
